DeviceProcessEvents
| where FileName =~ "powershell.exe"
| where ProcessCommandLine contains "-enc"
    or ProcessCommandLine contains "-encodedcommand"
| project Timestamp,
          DeviceName,
          InitiatingProcessAccountName,
          ProcessCommandLine
| order by Timestamp desc
